Repository: JoaoClemer/fit-tech
Catalog: src/FitTech.Exceptions/ResourceErrorMessages.*.resx
Languages: pt

# EMPLOYEE_CPF_IN_USE
source: An employee is already using this CPF.
pt: Um funcionário já está utilizando esse CPF.

# EMPLOYEE_EMAIL_IN_USE
source: An employee is already using this e-mail.
pt: Um funcionário já está utilizando esse e-mail.

# EMPTY_ADDRESS
source: The property Address cannot be empty.
pt: A propriedade Address não pode estar vazia.

# EMPTY_CITY
source: The property City cannot be empty.
pt: A propriedade City não pode estar vazia.

# EMPTY_COUNTRY
source: The property Country cannot be empty.
pt: A propriedade Country não pode estar vazia.

# EMPTY_CPF
source: The property Cpf cannot be empty.
pt: A propriedade Cpf não pode estar vazia.

# EMPTY_EMAIL
source: The property EmailAddress cannot be empty.
pt: A propriedade EmailAddress não pode estar vazia.

# EMPTY_EMPLOYEE_TYPE
source: The property EmployeeType cannot be empty.
pt: A propriedade EmployeeType não pode estar vazia.

# EMPTY_GYM_ID
source: The property GymId cannot be empty.
pt: A propriedade GymId não pode estar vazia.

# EMPTY_NAME
source: The property Name cannot be empty.
pt: A propriedade Name não pode estar vazia.

# EMPTY_NUMBER
source: The property Number cannot be empty.
pt: A propriedade Number não pode estar vazia.

# EMPTY_PASSWORD
source: The property Password cannot be empty.
pt: A propriedade Password não pode estar vazia.

# EMPTY_PHONE_NUMBER
source: The property PhoneNumber cannot be empty.
pt: A propriedade PhoneNumber não pode estar vazia.

# EMPTY_POSTAL_CODE
source: The property PostalCode cannot be empty.
pt: A propriedade PostalCode não pode estar vazia.

# EMPTY_SALARY
source: The property Salary cannot be empty.
pt: A propriedade Salary não pode estar vazia.

# EMPTY_STATE
source: The property State cannot be empty.
pt: A propriedade State não pode estar vazia.

# EMPTY_STREET
source: The property Street cannot be empty.
pt: A propriedade Street não pode estar vazia.

# GYM_EMAIL_IN_USE
source: A gym is already using this e-mail.
pt: Uma academia já está utilizando esse e-mail.

# GYM_NAME_IN_USE
source: A gym is already using this name.
pt: Uma academia já está utilizando esse nome.

# GYM_NOT_FOUND
source: Não existe nenhuma academia com o Id informado.
pt: There is no gym with the specified ID.

# INVALID_CPF
source: This CPF is not valid, make sure it has been entered correctly, it must follow the pattern XXX.XXX.XXX-XX
pt: Este CPF não é válido, certifique-se que foi digitado corretamente, deve seguir o padrão XXX.XXX.XXX-XX

# INVALID_EMAIL
source: This e-mail is not valid.
pt: Esse e-mail não é válido.

# INVALID_PASSWORD
source: This password is not valid, it must be at least 6 characters long.
pt: Esta senha não é válida, deve ter pelo menos 6 caracteres.

# INVALID_PHONE_NUMBER
source: This phone number is not valid, it must follow the pattern (XX) X XXXX-XXXX.
pt: Este número de telefone não é válido, deve seguir o padrão (XX) X XXXX-XXXX.

# INVALID_POSTAL_CODE
source: This postal code is not valid, it must follow the pattern XXXXX-XXX.
pt: Este CEP não é válido, deve seguir o padrão XXXXX-XXX.

# INVALID_STATE
source: In the State property, only the state acronym must be entered. Exemple: SP.
pt: Na propriedade Estado deve ser informada apenas a sigla do estado, exemplo: SP.

# STUDENT_CPF_IN_USE
source: A student is already using this CPF.
pt: Um aluno já está utilizando esse CPF.

# STUDENT_EMAIL_IN_USE
source: A student is already using this e-mail.
pt: Um aluno já está utilizando esse e-mail.

source: Unknow error.
pt: Erro desconhecido.
